app/views/users/sales_host.html.erb

SELECT `presentations`.* FROM `presentations` WHERE `presentations`.`user_id` = 1
---

				 <% current_user.presentations.each do |pre| %>