app/views/webnairs/_index.html.erb

SELECT `webnairs`.* FROM `webnairs` WHERE `webnairs`.`user_id` = 1
---

<% current_user.webnairs.to_a.each do |w| %>