app/controllers/presentations_controller.rb

  def create
    @presentation = Presentation.new( presentation_params )
   # @presentation.avatar_from_url(params[:avatar_url])
    if @presentation.save
---
INSERT INTO `presentations` (`avatar_content_type`, `avatar_file_name`, `avatar_file_size`, `avatar_updated_at`, `created_at`, `description`, `title`, `updated_at`, `user_id`) VALUES ('application/vnd.ms-powerpoint', 'example.ppt', 1709056, '2014-09-22 06:34:28', '2014-09-22 06:34:28', 'hello', 'pre1', '2014-09-22 06:34:28', 1)

  def edit
    @presentation = Presentation.find(params[:id])
---
SELECT `presentations`.* FROM `presentations` WHERE `presentations`.`id` = 1 LIMIT 1

  def update

     respond_to do |format|
      if @presentation.update(presentation_params)
---
UPDATE `presentations` SET `avatar_updated_at` = '2014-09-22 06:52:46', `avatar_file_name` = 'example.ppt', `updated_at` = '2014-09-22 06:52:46' WHERE `presentations`.`id` = 1

  def set_presentation
      @presentation = Presentation.find(params[:id])
---
SELECT `presentations`.* FROM `presentations` WHERE `presentations`.`id` = 1 LIMIT 1