app/controllers/webnairs_controller.rb

    def create
        @webnair = Webnair.new( webnairs_params )
              if @webnair.save
---
INSERT INTO `webnairs` (`choice`, `created_at`, `description`, `ppt_content_type`, `ppt_file_name`, `ppt_file_size`, `ppt_updated_at`, `title`, `updated_at`, `user_id`) VALUES (0, '2014-09-22 06:40:14', 'ddd', 'application/vnd.ms-powerpoint', 'example.ppt', 1709056, '2014-09-22 06:40:14', 'Webnair1', '2014-09-22 06:40:14', 1)

    def set_webnair
        @webnair = Webnair.find(params[:id])
---
SELECT `webnairs`.* FROM `webnairs` WHERE `webnairs`.`id` = 1 LIMIT 1